In [31]:
import pandas as pd
import numpy as np

In [32]:
df = pd.read_csv('tips.csv')

In [33]:
print(df.columns)
print(df.index)
print(df.head())
print(df.tail())
print(df.info())

Index(['total_bill', 'tip', 'gender', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')
RangeIndex(start=0, stop=244, step=1)
   total_bill  tip  gender smoker  day    time  size  price_per_person  \
0          17    1  Female     No  Sun  Dinner     2                 8
1          10    2    Male     No  Sun  Dinner     3                 3
2          21    4    Male     No  Sun  Dinner     3                 7
3          24    3    Male     No  Sun  Dinner     2                12
4          25    4  Female     No  Sun  Dinner     4                 6

           Payer Name        CC Number Payment ID
0  Christy Cunningham 3560330000000000    Sun2959
1      Douglas Tucker 4478070000000000    Sun4608
2      Travis Walters 6011810000000000    Sun4458
3    Nathaniel Harris 4676140000000000    Sun5260
4        Tonya Carter 4832730000000000    Sun2251
     total_bill  tip  gender smoker   day    time  size  price_per_person  \
239          29    6    Male     No   Sat  Dinner     3                10
240          27    2  Female    Yes   Sat  Dinner     2                14
241          23    2    Male    Yes   Sat  Dinner     2                11
242          18    2    Male     No   Sat  Dinner     2                 9
243          19    3  Female     No  Thur  Dinner     2                 9

          Payer Name        CC Number Payment ID
239    Michael Avila 5296070000000000    Sat2657
240   Monica Sanders 3506810000000000    Sat1766
241       Keith Wong 6011890000000000    Sat3880
242     Dennis Dixon    4375220000000      Sat17
243  Michelle Hardin 3511450000000000    Thur672
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   gender            244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    float64
 10  Payment ID        244 non-null    object
dtypes: float64(4), int64(1), object(6)
memory usage: 21.1+ KB
None

In [34]:
print(len(df))
print(df.describe())

244
       total_bill  tip  size  price_per_person        CC Number
count         244  244   244               244              244
mean           20    3     3                 8 2563495461217592
std             9    1     1                 3 2369339716610890
min             3    1     1                 3      60406789937
25%            13    2     2                 6   30407325000000
50%            18    3     2                 7 3525320000000000
75%            24    4     3                 9 4553675000000000
max            51   10     6                20 6596450000000000

In [35]:
print(df.describe().transpose())

                  count             mean              std         min  \
total_bill          244               20                9           3
tip                 244                3                1           1
size                244                3                1           1
price_per_person    244                8                3           3
CC Number           244 2563495461217592 2369339716610890 60406789937

                            25%              50%              75%  \
total_bill                   13               18               24
tip                           2                3                4
size                          2                2                3
price_per_person              6                7                9
CC Number        30407325000000 3525320000000000 4553675000000000

                              max
total_bill                     51
tip                            10
size                            6
price_per_person               20
CC Number        6596450000000000

In [36]:
pd.set_option('display.float_format', '{:.0f}'.format)

In [37]:
print(df.describe())

       total_bill  tip  size  price_per_person        CC Number
count         244  244   244               244              244
mean           20    3     3                 8 2563495461217592
std             9    1     1                 3 2369339716610890
min             3    1     1                 3      60406789937
25%            13    2     2                 6   30407325000000
50%            18    3     2                 7 3525320000000000
75%            24    4     3                 9 4553675000000000
max            51   10     6                20 6596450000000000

In [38]:
pd.set_option('display.float_format', lambda x: '%.0f' % x)

In [39]:
print(df.describe())

       total_bill  tip  size  price_per_person        CC Number
count         244  244   244               244              244
mean           20    3     3                 8 2563495461217592
std             9    1     1                 3 2369339716610890
min             3    1     1                 3      60406789937
25%            13    2     2                 6   30407325000000
50%            18    3     2                 7 3525320000000000
75%            24    4     3                 9 4553675000000000
max            51   10     6                20 6596450000000000

In [40]:
print(df['total_bill'])

0     17
1     10
2     21
3     24
4     25
      ..
239   29
240   27
241   23
242   18
243   19
Name: total_bill, Length: 244, dtype: float64

In [41]:
print(df.total_bill)

0     17
1     10
2     21
3     24
4     25
      ..
239   29
240   27
241   23
242   18
243   19
Name: total_bill, Length: 244, dtype: float64

In [42]:
print(df[['total_bill', 'tip']])

     total_bill  tip
0            17    1
1            10    2
2            21    4
3            24    3
4            25    4
..          ...  ...
239          29    6
240          27    2
241          23    2
242          18    2
243          19    3

[244 rows x 2 columns]

In [43]:
df['tip_percentage'] = (df['tip'] / df['total_bill']) * 100

In [44]:
df

,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,17,1,Female,No,Sun,Dinner,2,8,Christy Cunningham,3560330000000000,Sun2959,6
1,10,2,Male,No,Sun,Dinner,3,3,Douglas Tucker,4478070000000000,Sun4608,16
2,21,4,Male,No,Sun,Dinner,3,7,Travis Walters,6011810000000000,Sun4458,17
3,24,3,Male,No,Sun,Dinner,2,12,Nathaniel Harris,4676140000000000,Sun5260,14
4,25,4,Female,No,Sun,Dinner,4,6,Tonya Carter,4832730000000000,Sun2251,15
...,...,...,...,...,...,...,...,...,...,...,...,...
239,29,6,Male,No,Sat,Dinner,3,10,Michael Avila,5296070000000000,Sat2657,20
240,27,2,Female,Yes,Sat,Dinner,2,14,Monica Sanders,3506810000000000,Sat1766,7
241,23,2,Male,Yes,Sat,Dinner,2,11,Keith Wong,6011890000000000,Sat3880,9
242,18,2,Male,No,Sat,Dinner,2,9,Dennis Dixon,4375220000000,Sat17,10
243,19,3,Female,No,Thur,Dinner,2,9,Michelle Hardin,3511450000000000,Thur672,16

In [45]:
df['price_per_person'] = df['total_bill'] / df['size']

In [46]:
df

,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,17,1,Female,No,Sun,Dinner,2,8,Christy Cunningham,3560330000000000,Sun2959,6
1,10,2,Male,No,Sun,Dinner,3,3,Douglas Tucker,4478070000000000,Sun4608,16
2,21,4,Male,No,Sun,Dinner,3,7,Travis Walters,6011810000000000,Sun4458,17
3,24,3,Male,No,Sun,Dinner,2,12,Nathaniel Harris,4676140000000000,Sun5260,14
4,25,4,Female,No,Sun,Dinner,4,6,Tonya Carter,4832730000000000,Sun2251,15
...,...,...,...,...,...,...,...,...,...,...,...,...
239,29,6,Male,No,Sat,Dinner,3,10,Michael Avila,5296070000000000,Sat2657,20
240,27,2,Female,Yes,Sat,Dinner,2,14,Monica Sanders,3506810000000000,Sat1766,7
241,23,2,Male,Yes,Sat,Dinner,2,11,Keith Wong,6011890000000000,Sat3880,9
242,18,2,Male,No,Sat,Dinner,2,9,Dennis Dixon,4375220000000,Sat17,10
243,19,3,Female,No,Thur,Dinner,2,9,Michelle Hardin,3511450000000000,Thur672,16

In [47]:
df['price_per_person'] = np.round(df['total_bill'] / df['size'])

In [48]:
df

,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip_percentage
0,17,1,Female,No,Sun,Dinner,2,8,Christy Cunningham,3560330000000000,Sun2959,6
1,10,2,Male,No,Sun,Dinner,3,3,Douglas Tucker,4478070000000000,Sun4608,16
2,21,4,Male,No,Sun,Dinner,3,7,Travis Walters,6011810000000000,Sun4458,17
3,24,3,Male,No,Sun,Dinner,2,12,Nathaniel Harris,4676140000000000,Sun5260,14
4,25,4,Female,No,Sun,Dinner,4,6,Tonya Carter,4832730000000000,Sun2251,15
...,...,...,...,...,...,...,...,...,...,...,...,...
239,29,6,Male,No,Sat,Dinner,3,10,Michael Avila,5296070000000000,Sat2657,20
240,27,2,Female,Yes,Sat,Dinner,2,14,Monica Sanders,3506810000000000,Sat1766,7
241,23,2,Male,Yes,Sat,Dinner,2,11,Keith Wong,6011890000000000,Sat3880,9
242,18,2,Male,No,Sat,Dinner,2,9,Dennis Dixon,4375220000000,Sat17,10
243,19,3,Female,No,Thur,Dinner,2,9,Michelle Hardin,3511450000000000,Thur672,16

In [49]:
df = df.drop('tip_percentage', axis=1)

In [50]:
df

,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,17,1,Female,No,Sun,Dinner,2,8,Christy Cunningham,3560330000000000,Sun2959
1,10,2,Male,No,Sun,Dinner,3,3,Douglas Tucker,4478070000000000,Sun4608
2,21,4,Male,No,Sun,Dinner,3,7,Travis Walters,6011810000000000,Sun4458
3,24,3,Male,No,Sun,Dinner,2,12,Nathaniel Harris,4676140000000000,Sun5260
4,25,4,Female,No,Sun,Dinner,4,6,Tonya Carter,4832730000000000,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29,6,Male,No,Sat,Dinner,3,10,Michael Avila,5296070000000000,Sat2657
240,27,2,Female,Yes,Sat,Dinner,2,14,Monica Sanders,3506810000000000,Sat1766
241,23,2,Male,Yes,Sat,Dinner,2,11,Keith Wong,6011890000000000,Sat3880
242,18,2,Male,No,Sat,Dinner,2,9,Dennis Dixon,4375220000000,Sat17
243,19,3,Female,No,Thur,Dinner,2,9,Michelle Hardin,3511450000000000,Thur672

In [51]:
df = df.set_index('Payment ID')

In [52]:
df

,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number
Payment ID,,,,,,,,,,
Sun2959,17,1,Female,No,Sun,Dinner,2,8,Christy Cunningham,3560330000000000
Sun4608,10,2,Male,No,Sun,Dinner,3,3,Douglas Tucker,4478070000000000
Sun4458,21,4,Male,No,Sun,Dinner,3,7,Travis Walters,6011810000000000
Sun5260,24,3,Male,No,Sun,Dinner,2,12,Nathaniel Harris,4676140000000000
Sun2251,25,4,Female,No,Sun,Dinner,4,6,Tonya Carter,4832730000000000
...,...,...,...,...,...,...,...,...,...,...
Sat2657,29,6,Male,No,Sat,Dinner,3,10,Michael Avila,5296070000000000
Sat1766,27,2,Female,Yes,Sat,Dinner,2,14,Monica Sanders,3506810000000000
Sat3880,23,2,Male,Yes,Sat,Dinner,2,11,Keith Wong,6011890000000000
Sat17,18,2,Male,No,Sat,Dinner,2,9,Dennis Dixon,4375220000000
Thur672,19,3,Female,No,Thur,Dinner,2,9,Michelle Hardin,3511450000000000

In [53]:
df = df.reset_index()

In [54]:
df

,Payment ID,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number
0,Sun2959,17,1,Female,No,Sun,Dinner,2,8,Christy Cunningham,3560330000000000
1,Sun4608,10,2,Male,No,Sun,Dinner,3,3,Douglas Tucker,4478070000000000
2,Sun4458,21,4,Male,No,Sun,Dinner,3,7,Travis Walters,6011810000000000
3,Sun5260,24,3,Male,No,Sun,Dinner,2,12,Nathaniel Harris,4676140000000000
4,Sun2251,25,4,Female,No,Sun,Dinner,4,6,Tonya Carter,4832730000000000
...,...,...,...,...,...,...,...,...,...,...,...
239,Sat2657,29,6,Male,No,Sat,Dinner,3,10,Michael Avila,5296070000000000
240,Sat1766,27,2,Female,Yes,Sat,Dinner,2,14,Monica Sanders,3506810000000000
241,Sat3880,23,2,Male,Yes,Sat,Dinner,2,11,Keith Wong,6011890000000000
242,Sat17,18,2,Male,No,Sat,Dinner,2,9,Dennis Dixon,4375220000000
243,Thur672,19,3,Female,No,Thur,Dinner,2,9,Michelle Hardin,3511450000000000

In [55]:
print(df['total_bill'] > 30)

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Name: total_bill, Length: 244, dtype: bool

In [56]:
print(df[df['total_bill'] > 30])

    Payment ID  total_bill  tip  gender smoker   day    time  size  \
11     Sun6686          35    5  Female     No   Sun  Dinner     4
23      Sat239          39    8    Male     No   Sat  Dinner     4
39     Sat6373          31    5    Male     No   Sat  Dinner     3
44     Sun2274          30    6    Male     No   Sun  Dinner     4
47     Sun9677          32    6    Male     No   Sun  Dinner     4
52     Sun6165          35    5  Female     No   Sun  Dinner     4
56     Sat8903          38    3    Male    Yes   Sat  Dinner     4
59     Sat8139          48    7    Male     No   Sat  Dinner     4
83    Thur8801          33    5    Male    Yes  Thur   Lunch     2
85    Thur7972          35    5  Female     No  Thur   Lunch     4
95     Fri9628          40    5    Male    Yes   Fri  Dinner     4
102    Sat6240          44    2  Female    Yes   Sat  Dinner     3
112     Sun591          38    4    Male     No   Sun  Dinner     3
141   Thur1025          34    7    Male     No  Thur   Lunch     6
142   Thur3621          41    5    Male     No  Thur   Lunch     5
156    Sun7518          48    5    Male     No   Sun  Dinner     6
167    Sun3719          32    4    Male     No   Sun  Dinner     4
170    Sat1954          51   10    Male    Yes   Sat  Dinner     3
173    Sun9335          32    3    Male    Yes   Sun  Dinner     2
175    Sun5109          33    3    Male    Yes   Sun  Dinner     2
179    Sun9851          35    4    Male    Yes   Sun  Dinner     2
180    Sun7544          35    4    Male    Yes   Sun  Dinner     4
182    Sun2337          45    4    Male    Yes   Sun  Dinner     3
184    Sun5140          41    3    Male    Yes   Sun  Dinner     2
187    Sun9987          30    2    Male    Yes   Sun  Dinner     5
197   Thur9313          43    5  Female    Yes  Thur   Lunch     4
207    Sat4505          39    3    Male    Yes   Sat  Dinner     4
210    Sat8361          30    2    Male    Yes   Sat  Dinner     3
212    Sat4590          48    9    Male     No   Sat  Dinner     4
219    Sat8863          30    3  Female    Yes   Sat  Dinner     4
237    Sat2929          33    1    Male    Yes   Sat  Dinner     2
238    Sat9777          36    5  Female     No   Sat  Dinner     3

     price_per_person             Payer Name        CC Number
11                  9           Diane Macias 4577820000000000
23                 10         Lance Peterson 3542580000000000
39                 10      Mr. Brandon Berry 6011530000000000
44                  8            Todd Cooper     503847000000
47                  8           James Barnes 3552000000000000
52                  9           Emily Daniel 4291280000000000
56                 10  James Christensen DDS  349794000000000
59                 12            Brian Ortiz 6596450000000000
83                 16          Daniel Murphy 5356180000000000
85                  9            Shawna Cook 6011790000000000
95                 10          Aaron Bentley  180027000000000
102                15          Heather Cohen  379771000000000
112                13             Jeff Lopez 3572870000000000
141                 6         Steven Carlson 3526520000000000
142                 8           Eric Andrews 4356530000000000
156                 8          Ryan Gonzales 3523150000000000
167                 8         Michael Lawson 3566290000000000
170                17          Gregory Clark 5473850000000000
173                16            Scott Perez 3577120000000000
175                16        Nathan Reynolds  370307000000000
179                17           Brian Bailey  346656000000000
180                 9       James Hebert DDS     676169000000
182                15           Jose Parsons 4112210000000000
184                20            Stephen Cox 3547800000000000
187                 6          David Barrett 4792880000000000
197                11            Brooke Soto 5544900000000000
207                10          Ricky Ramirez  347818000000000
210                10          Shawn Mendoza   30184000000000
212                12        Alex Williamson     676219000000
219                 8           Shelby House     502097000000
237                16           Thomas Brown 4284720000000000
238                12         Kimberly Crane     676184000000

In [58]:
filter_df = df[(df['total_bill'] > 30) & (df['gender'] == "Male")]
filter_df

,Payment ID,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number
23,Sat239,39,8,Male,No,Sat,Dinner,4,10,Lance Peterson,3542580000000000
39,Sat6373,31,5,Male,No,Sat,Dinner,3,10,Mr. Brandon Berry,6011530000000000
44,Sun2274,30,6,Male,No,Sun,Dinner,4,8,Todd Cooper,503847000000
47,Sun9677,32,6,Male,No,Sun,Dinner,4,8,James Barnes,3552000000000000
56,Sat8903,38,3,Male,Yes,Sat,Dinner,4,10,James Christensen DDS,349794000000000
59,Sat8139,48,7,Male,No,Sat,Dinner,4,12,Brian Ortiz,6596450000000000
83,Thur8801,33,5,Male,Yes,Thur,Lunch,2,16,Daniel Murphy,5356180000000000
95,Fri9628,40,5,Male,Yes,Fri,Dinner,4,10,Aaron Bentley,180027000000000
112,Sun591,38,4,Male,No,Sun,Dinner,3,13,Jeff Lopez,3572870000000000
141,Thur1025,34,7,Male,No,Thur,Lunch,6,6,Steven Carlson,3526520000000000
142,Thur3621,41,5,Male,No,Thur,Lunch,5,8,Eric Andrews,4356530000000000
156,Sun7518,48,5,Male,No,Sun,Dinner,6,8,Ryan Gonzales,3523150000000000
167,Sun3719,32,4,Male,No,Sun,Dinner,4,8,Michael Lawson,3566290000000000
170,Sat1954,51,10,Male,Yes,Sat,Dinner,3,17,Gregory Clark,5473850000000000
173,Sun9335,32,3,Male,Yes,Sun,Dinner,2,16,Scott Perez,3577120000000000
175,Sun5109,33,3,Male,Yes,Sun,Dinner,2,16,Nathan Reynolds,370307000000000
179,Sun9851,35,4,Male,Yes,Sun,Dinner,2,17,Brian Bailey,346656000000000
180,Sun7544,35,4,Male,Yes,Sun,Dinner,4,9,James Hebert DDS,676169000000
182,Sun2337,45,4,Male,Yes,Sun,Dinner,3,15,Jose Parsons,4112210000000000
184,Sun5140,41,3,Male,Yes,Sun,Dinner,2,20,Stephen Cox,3547800000000000
187,Sun9987,30,2,Male,Yes,Sun,Dinner,5,6,David Barrett,4792880000000000
207,Sat4505,39,3,Male,Yes,Sat,Dinner,4,10,Ricky Ramirez,347818000000000
210,Sat8361,30,2,Male,Yes,Sat,Dinner,3,10,Shawn Mendoza,30184000000000
212,Sat4590,48,9,Male,No,Sat,Dinner,4,12,Alex Williamson,676219000000
237,Sat2929,33,1,Male,Yes,Sat,Dinner,2,16,Thomas Brown,4284720000000000

In [59]:
print(df[(df['total_bill'] > 30) | (df['size'] >= 5)])

    Payment ID  total_bill  tip  gender smoker   day    time  size  \
11     Sun6686          35    5  Female     No   Sun  Dinner     4
23      Sat239          39    8    Male     No   Sat  Dinner     4
39     Sat6373          31    5    Male     No   Sat  Dinner     3
44     Sun2274          30    6    Male     No   Sun  Dinner     4
47     Sun9677          32    6    Male     No   Sun  Dinner     4
52     Sun6165          35    5  Female     No   Sun  Dinner     4
56     Sat8903          38    3    Male    Yes   Sat  Dinner     4
59     Sat8139          48    7    Male     No   Sat  Dinner     4
83    Thur8801          33    5    Male    Yes  Thur   Lunch     2
85    Thur7972          35    5  Female     No  Thur   Lunch     4
95     Fri9628          40    5    Male    Yes   Fri  Dinner     4
102    Sat6240          44    2  Female    Yes   Sat  Dinner     3
112     Sun591          38    4    Male     No   Sun  Dinner     3
125   Thur3948          30    4  Female     No  Thur   Lunch     6
141   Thur1025          34    7    Male     No  Thur   Lunch     6
142   Thur3621          41    5    Male     No  Thur   Lunch     5
143   Thur6179          27    5  Female     No  Thur   Lunch     6
155    Sun9176          30    5  Female     No   Sun  Dinner     5
156    Sun7518          48    5    Male     No   Sun  Dinner     6
167    Sun3719          32    4    Male     No   Sun  Dinner     4
170    Sat1954          51   10    Male    Yes   Sat  Dinner     3
173    Sun9335          32    3    Male    Yes   Sun  Dinner     2
175    Sun5109          33    3    Male    Yes   Sun  Dinner     2
179    Sun9851          35    4    Male    Yes   Sun  Dinner     2
180    Sun7544          35    4    Male    Yes   Sun  Dinner     4
182    Sun2337          45    4    Male    Yes   Sun  Dinner     3
184    Sun5140          41    3    Male    Yes   Sun  Dinner     2
185    Sun5842          21    5    Male     No   Sun  Dinner     5
187    Sun9987          30    2    Male    Yes   Sun  Dinner     5
197   Thur9313          43    5  Female    Yes  Thur   Lunch     4
207    Sat4505          39    3    Male    Yes   Sat  Dinner     4
210    Sat8361          30    2    Male    Yes   Sat  Dinner     3
212    Sat4590          48    9    Male     No   Sat  Dinner     4
216    Sat7320          28    3    Male    Yes   Sat  Dinner     5
219    Sat8863          30    3  Female    Yes   Sat  Dinner     4
237    Sat2929          33    1    Male    Yes   Sat  Dinner     2
238    Sat9777          36    5  Female     No   Sat  Dinner     3

     price_per_person             Payer Name        CC Number
11                  9           Diane Macias 4577820000000000
23                 10         Lance Peterson 3542580000000000
39                 10      Mr. Brandon Berry 6011530000000000
44                  8            Todd Cooper     503847000000
47                  8           James Barnes 3552000000000000
52                  9           Emily Daniel 4291280000000000
56                 10  James Christensen DDS  349794000000000
59                 12            Brian Ortiz 6596450000000000
83                 16          Daniel Murphy 5356180000000000
85                  9            Shawna Cook 6011790000000000
95                 10          Aaron Bentley  180027000000000
102                15          Heather Cohen  379771000000000
112                13             Jeff Lopez 3572870000000000
125                 5         Angela Sanchez     503857000000
141                 6         Steven Carlson 3526520000000000
142                 8           Eric Andrews 4356530000000000
143                 5           Regina Jones    4311050000000
155                 6         Madison Wilson 4210880000000000
156                 8          Ryan Gonzales 3523150000000000
167                 8         Michael Lawson 3566290000000000
170                17          Gregory Clark 5473850000000000
173                16            Scott Perez 3577120000000000
175                16        Nathan Reynolds  370307000000000
179                17           Brian Bailey  346656000000000
180                 9       James Hebert DDS     676169000000
182                15           Jose Parsons 4112210000000000
184                20            Stephen Cox 3547800000000000
185                 4          Joseph Howell   30362400000000
187                 6          David Barrett 4792880000000000
197                11            Brooke Soto 5544900000000000
207                10          Ricky Ramirez  347818000000000
210                10          Shawn Mendoza   30184000000000
212                12        Alex Williamson     676219000000
216                 6      Shawn Barnett PhD    4590980000000
219                 8           Shelby House     502097000000
237                16           Thomas Brown 4284720000000000
238                12         Kimberly Crane     676184000000

In [60]:
options = ['Sat', 'Sun']

In [61]:
print(df[df['day'].isin(options)])

    Payment ID  total_bill  tip  gender smoker  day    time  size  \
0      Sun2959          17    1  Female     No  Sun  Dinner     2
1      Sun4608          10    2    Male     No  Sun  Dinner     3
2      Sun4458          21    4    Male     No  Sun  Dinner     3
3      Sun5260          24    3    Male     No  Sun  Dinner     2
4      Sun2251          25    4  Female     No  Sun  Dinner     4
..         ...         ...  ...     ...    ...  ...     ...   ...
238    Sat9777          36    5  Female     No  Sat  Dinner     3
239    Sat2657          29    6    Male     No  Sat  Dinner     3
240    Sat1766          27    2  Female    Yes  Sat  Dinner     2
241    Sat3880          23    2    Male    Yes  Sat  Dinner     2
242      Sat17          18    2    Male     No  Sat  Dinner     2

     price_per_person          Payer Name        CC Number
0                   8  Christy Cunningham 3560330000000000
1                   3      Douglas Tucker 4478070000000000
2                   7      Travis Walters 6011810000000000
3                  12    Nathaniel Harris 4676140000000000
4                   6        Tonya Carter 4832730000000000
..                ...                 ...              ...
238                12      Kimberly Crane     676184000000
239                10       Michael Avila 5296070000000000
240                14      Monica Sanders 3506810000000000
241                11          Keith Wong 6011890000000000
242                 9        Dennis Dixon    4375220000000

[163 rows x 11 columns]

In [71]:
filterd1 = df[(df['gender'] == "Female") & (df['tip'] >= 4)]
filtered2 = df.query("gender == 'Female' and tip >= 4")
filtered3 = df.loc[(df['gender'] == "Female") & (df['tip'] >= 4)]
filtered4 = df.where((df['gender'] == "Female") & (df['tip'] >= 4)).dropna()

In [65]:
print(filterd1)

    Payment ID  total_bill  tip  gender smoker   day    time  size  \
11     Sun6686          35    5  Female     No   Sun  Dinner     4
52     Sun6165          35    5  Female     No   Sun  Dinner     4
73     Sat6065          25    5  Female    Yes   Sat  Dinner     2
85    Thur7972          35    5  Female     No  Thur   Lunch     4
93     Fri6963          16    4  Female    Yes   Fri  Dinner     2
104    Sat3194          21    4  Female     No   Sat  Dinner     2
109    Sat2614          14    4  Female    Yes   Sat  Dinner     2
114    Sun6492          26    4  Female     No   Sun  Dinner     3
125   Thur3948          30    4  Female     No  Thur   Lunch     6
143   Thur6179          27    5  Female     No  Thur   Lunch     6
155    Sun9176          30    5  Female     No   Sun  Dinner     5
178    Sun4598          10    4  Female    Yes   Sun  Dinner     2
191    Thur967          20    4  Female    Yes  Thur   Lunch     2
197   Thur9313          43    5  Female    Yes  Thur   Lunch     4
214    Sat3374          28    6  Female    Yes   Sat  Dinner     3
238    Sat9777          36    5  Female     No   Sat  Dinner     3

     price_per_person           Payer Name        CC Number
11                  9         Diane Macias 4577820000000000
52                  9         Emily Daniel 4291280000000000
73                 13         Julie Holmes 5418690000000000
85                  9          Shawna Cook 6011790000000000
93                  8       Natalie Nguyen 5181240000000000
104                10  Gabrielle Frederick 4013010000000000
109                 7      Amanda Anderson  375639000000000
114                 9          Katie Smith 5400160000000000
125                 5       Angela Sanchez     503857000000
143                 5         Regina Jones    4311050000000
155                 6       Madison Wilson 4210880000000000
178                 5         Melanie Gray    4211810000000
191                10          Kristy Boyd 4317020000000000
197                11          Brooke Soto 5544900000000000
214                 9      Marissa Jackson 4922300000000000
238                12       Kimberly Crane     676184000000

In [66]:
print(filtered2)

    Payment ID  total_bill  tip  gender smoker   day    time  size  \
11     Sun6686          35    5  Female     No   Sun  Dinner     4
52     Sun6165          35    5  Female     No   Sun  Dinner     4
73     Sat6065          25    5  Female    Yes   Sat  Dinner     2
85    Thur7972          35    5  Female     No  Thur   Lunch     4
93     Fri6963          16    4  Female    Yes   Fri  Dinner     2
104    Sat3194          21    4  Female     No   Sat  Dinner     2
109    Sat2614          14    4  Female    Yes   Sat  Dinner     2
114    Sun6492          26    4  Female     No   Sun  Dinner     3
125   Thur3948          30    4  Female     No  Thur   Lunch     6
143   Thur6179          27    5  Female     No  Thur   Lunch     6
155    Sun9176          30    5  Female     No   Sun  Dinner     5
178    Sun4598          10    4  Female    Yes   Sun  Dinner     2
191    Thur967          20    4  Female    Yes  Thur   Lunch     2
197   Thur9313          43    5  Female    Yes  Thur   Lunch     4
214    Sat3374          28    6  Female    Yes   Sat  Dinner     3
238    Sat9777          36    5  Female     No   Sat  Dinner     3

     price_per_person           Payer Name        CC Number
11                  9         Diane Macias 4577820000000000
52                  9         Emily Daniel 4291280000000000
73                 13         Julie Holmes 5418690000000000
85                  9          Shawna Cook 6011790000000000
93                  8       Natalie Nguyen 5181240000000000
104                10  Gabrielle Frederick 4013010000000000
109                 7      Amanda Anderson  375639000000000
114                 9          Katie Smith 5400160000000000
125                 5       Angela Sanchez     503857000000
143                 5         Regina Jones    4311050000000
155                 6       Madison Wilson 4210880000000000
178                 5         Melanie Gray    4211810000000
191                10          Kristy Boyd 4317020000000000
197                11          Brooke Soto 5544900000000000
214                 9      Marissa Jackson 4922300000000000
238                12       Kimberly Crane     676184000000

In [67]:
print(filtered3)

    Payment ID  total_bill  tip  gender smoker   day    time  size  \
11     Sun6686          35    5  Female     No   Sun  Dinner     4
52     Sun6165          35    5  Female     No   Sun  Dinner     4
73     Sat6065          25    5  Female    Yes   Sat  Dinner     2
85    Thur7972          35    5  Female     No  Thur   Lunch     4
93     Fri6963          16    4  Female    Yes   Fri  Dinner     2
104    Sat3194          21    4  Female     No   Sat  Dinner     2
109    Sat2614          14    4  Female    Yes   Sat  Dinner     2
114    Sun6492          26    4  Female     No   Sun  Dinner     3
125   Thur3948          30    4  Female     No  Thur   Lunch     6
143   Thur6179          27    5  Female     No  Thur   Lunch     6
155    Sun9176          30    5  Female     No   Sun  Dinner     5
178    Sun4598          10    4  Female    Yes   Sun  Dinner     2
191    Thur967          20    4  Female    Yes  Thur   Lunch     2
197   Thur9313          43    5  Female    Yes  Thur   Lunch     4
214    Sat3374          28    6  Female    Yes   Sat  Dinner     3
238    Sat9777          36    5  Female     No   Sat  Dinner     3

     price_per_person           Payer Name        CC Number
11                  9         Diane Macias 4577820000000000
52                  9         Emily Daniel 4291280000000000
73                 13         Julie Holmes 5418690000000000
85                  9          Shawna Cook 6011790000000000
93                  8       Natalie Nguyen 5181240000000000
104                10  Gabrielle Frederick 4013010000000000
109                 7      Amanda Anderson  375639000000000
114                 9          Katie Smith 5400160000000000
125                 5       Angela Sanchez     503857000000
143                 5         Regina Jones    4311050000000
155                 6       Madison Wilson 4210880000000000
178                 5         Melanie Gray    4211810000000
191                10          Kristy Boyd 4317020000000000
197                11          Brooke Soto 5544900000000000
214                 9      Marissa Jackson 4922300000000000
238                12       Kimberly Crane     676184000000

In [72]:
print(filtered4)

    Payment ID  total_bill  tip  gender smoker   day    time  size  \
11     Sun6686          35    5  Female     No   Sun  Dinner     4
52     Sun6165          35    5  Female     No   Sun  Dinner     4
73     Sat6065          25    5  Female    Yes   Sat  Dinner     2
85    Thur7972          35    5  Female     No  Thur   Lunch     4
93     Fri6963          16    4  Female    Yes   Fri  Dinner     2
104    Sat3194          21    4  Female     No   Sat  Dinner     2
109    Sat2614          14    4  Female    Yes   Sat  Dinner     2
114    Sun6492          26    4  Female     No   Sun  Dinner     3
125   Thur3948          30    4  Female     No  Thur   Lunch     6
143   Thur6179          27    5  Female     No  Thur   Lunch     6
155    Sun9176          30    5  Female     No   Sun  Dinner     5
178    Sun4598          10    4  Female    Yes   Sun  Dinner     2
191    Thur967          20    4  Female    Yes  Thur   Lunch     2
197   Thur9313          43    5  Female    Yes  Thur   Lunch     4
214    Sat3374          28    6  Female    Yes   Sat  Dinner     3
238    Sat9777          36    5  Female     No   Sat  Dinner     3

     price_per_person           Payer Name        CC Number
11                  9         Diane Macias 4577820000000000
52                  9         Emily Daniel 4291280000000000
73                 13         Julie Holmes 5418690000000000
85                  9          Shawna Cook 6011790000000000
93                  8       Natalie Nguyen 5181240000000000
104                10  Gabrielle Frederick 4013010000000000
109                 7      Amanda Anderson  375639000000000
114                 9          Katie Smith 5400160000000000
125                 5       Angela Sanchez     503857000000
143                 5         Regina Jones    4311050000000
155                 6       Madison Wilson 4210880000000000
178                 5         Melanie Gray    4211810000000
191                10          Kristy Boyd 4317020000000000
197                11          Brooke Soto 5544900000000000
214                 9      Marissa Jackson 4922300000000000
238                12       Kimberly Crane     676184000000

In [74]:
gender_counts = df['gender'].value_counts()
gender_counts

gender
Male      157
Female     87
Name: count, dtype: int64

In [75]:
sorted_by_bill = df.sort_values(by='total_bill')
sorted_by_bill

,Payment ID,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number
67,Sat3455,3,1,Female,Yes,Sat,Dinner,1,3,Tiffany Brock,4359490000000000
92,Fri3780,6,1,Female,Yes,Fri,Dinner,2,3,Leah Ramirez,3508910000000000
111,Sat4801,7,1,Female,No,Sat,Dinner,1,7,Terri Jones,3559220000000000
172,Sun9209,7,5,Male,Yes,Sun,Dinner,2,4,Larry White,30432600000000
149,Thur6321,8,2,Male,No,Thur,Lunch,2,4,Daniel Robbins,4823140000000000
...,...,...,...,...,...,...,...,...,...,...,...
182,Sun2337,45,4,Male,Yes,Sun,Dinner,3,15,Jose Parsons,4112210000000000
156,Sun7518,48,5,Male,No,Sun,Dinner,6,8,Ryan Gonzales,3523150000000000
59,Sat8139,48,7,Male,No,Sat,Dinner,4,12,Brian Ortiz,6596450000000000
212,Sat4590,48,9,Male,No,Sat,Dinner,4,12,Alex Williamson,676219000000
170,Sat1954,51,10,Male,Yes,Sat,Dinner,3,17,Gregory Clark,5473850000000000

In [78]:
sorted_by_tip_desc = df.sort_values(by='tip', ascending=False)
sorted_by_tip_desc

,Payment ID,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number
170,Sat1954,51,10,Male,Yes,Sat,Dinner,3,17,Gregory Clark,5473850000000000
212,Sat4590,48,9,Male,No,Sat,Dinner,4,12,Alex Williamson,676219000000
23,Sat239,39,8,Male,No,Sat,Dinner,4,10,Lance Peterson,3542580000000000
59,Sat8139,48,7,Male,No,Sat,Dinner,4,12,Brian Ortiz,6596450000000000
141,Thur1025,34,7,Male,No,Thur,Lunch,6,6,Steven Carlson,3526520000000000
...,...,...,...,...,...,...,...,...,...,...,...
0,Sun2959,17,1,Female,No,Sun,Dinner,2,8,Christy Cunningham,3560330000000000
111,Sat4801,7,1,Female,No,Sat,Dinner,1,7,Terri Jones,3559220000000000
92,Fri3780,6,1,Female,Yes,Fri,Dinner,2,3,Leah Ramirez,3508910000000000
67,Sat3455,3,1,Female,Yes,Sat,Dinner,1,3,Tiffany Brock,4359490000000000
236,Sat5032,13,1,Male,Yes,Sat,Dinner,2,6,Matthew Myers,3543680000000000

In [84]:
sorted_multiple = df.sort_values(by=['day', 'total_bill'], ascending=[True, False])
sorted_multiple

,Payment ID,total_bill,tip,gender,smoker,day,time,size,price_per_person,Payer Name,CC Number
95,Fri9628,40,5,Male,Yes,Fri,Dinner,4,10,Aaron Bentley,180027000000000
90,Fri4175,29,3,Male,Yes,Fri,Dinner,2,14,Daniel Mason,3597460000000000
96,Fri3159,27,4,Male,Yes,Fri,Dinner,2,14,Eric Carter,4563050000000000
94,Fri2318,23,3,Female,No,Fri,Dinner,2,11,Jamie Garza,676318000000
91,Fri5700,22,4,Male,No,Fri,Dinner,2,11,Earl Horn,6011850000000000
...,...,...,...,...,...,...,...,...,...,...,...
126,Thur6719,9,1,Male,No,Thur,Lunch,2,4,Mario Bradshaw,4524400000000000
135,Thur6600,9,1,Female,No,Thur,Lunch,2,4,Rebecca Harris,4320270000000000
145,Thur9331,8,2,Female,No,Thur,Lunch,2,4,Amy Young,4285450000000
195,Thur697,8,1,Male,No,Thur,Lunch,2,4,Michael White,4865390000000000
149,Thur6321,8,2,Male,No,Thur,Lunch,2,4,Daniel Robbins,4823140000000000

In [85]:
sorted_multiple.day.drop_duplicates()

95      Fri
170     Sat
156     Sun
197    Thur
Name: day, dtype: object

In [88]:
pd.DataFrame(['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'], columns=['Day']).sort_values(by='Day', ascending=True)

   Day
4  Fri
0  Mon
5  Sat
6  Sun
3  Thu
1  Tue
2  Wed

In [89]:
pd.DataFrame(['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'], columns=['Day']).sort_values(by='Day', ascending=False)

   Day
2  Wed
1  Tue
3  Thu
6  Sun
5  Sat
0  Mon
4  Fri